Revit 2027 API
FillGrid.GetSegmentDirection Method
 Provides the segment direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV GetSegmentDirection()
Public Function GetSegmentDirection As UV
public:
UV^ GetSegmentDirection()
member GetSegmentDirection : unit -> UV
Return Value
UV
 The direction of segment.
See Also
Reference
FillGrid Class
Autodesk.Revit.DB Namespace